const storeProducts = [
  // Категория: Электроника и аксессуары
  [
    ["Чехол для телефона", 450],
    ["USB-кабель", 290],
    ["Беспроводные наушники", 2490],
    ["Батарейки (4 шт)", 180],
  ],
  // Категория: Книги и канцелярия
  [
    ["Блокнот в кожаном переплете", 1200],
    ["Набор гелевых ручек", 350],
    ["Книга-бестселлер", 850],
    ["Маркеры для скетчинга", 600],
  ],
  // Категория: Дом и уют
  [
    ["Ароматическая свеча", 400],
    ["Термокружка", 1100],
    ["Настольная лампа", 1850],
    ["Коврик для мыши", 550],
  ],
];

let totalCost = 0;

for (let i = 0; i < storeProducts.length; i++) {
  for (let j = 0; j < storeProducts[i].length; j++) {
    const product = storeProducts[i][j];
    const name = product[0];
    const price = product[1];

    if (storeProducts[i][j][1] < 1000) {
      console.log(`Подходящая позиция: ${name}`);
      console.log(`Цена позиции: ${price} руб`);
      totalCost += price;
    }
  }
}

console.log(`Общая стоимость товаров до 1000 руб: ${totalCost}.`);
