let userName = "Tute";
console.log("Пользователь:", userName);

let myNumber;
console.log(myNumber);

const с_буквой_n = 9007199254740999n;
const без_буквы_n = 9007199254740999;

console.log(с_буквой_n); // Выведет: 9007199254740999n (значение сохранилось точно)
console.log(без_буквы_n); // Выведет: 9007199254741000  (число ИСКАЗИЛОСЬ!)

// Второго месяца (марта) -2-го числа не существует.
// Но JS просто прибавит/отнимет миллисекунды.
let magicDate = new Date(2026, 1, 30);

console.log(magicDate.toLocaleDateString());
// Выведет: "02.03.2026" (30 февраля превратилось в 2 марта!)
// ТОЛЬКО 32-битные знаковые целые числа (Int32Array)
let memory32 = new Int32Array(1);

// 1. Записываем пиковое значение (19 января 2038 года, 03:14:07 UTC)
memory32[0] = 2147483647;
console.log("Время 03:14:07 -> Секунд в памяти:", memory32[0]);
// Выведет: 2147483647

// 2. Наступает следующая секунда. Прибавляем 1
memory32[0] = memory32[0] + 1;

// 3. Смотрим, что произошло в памяти компьютера
console.log("Время 03:14:08 -> Секунд в памяти:", memory32[0]);
// Выведет: -2147483648 !

console.log('Иван сказал "Привет"'); // Результат: Иван сказал "Привет"
